app/Controllers/Auth.php

                    $courseIds = array_column($enrolledCourses, 'course_id');
                    if (!empty($courseIds) && is_array($courseIds)) {
                        try {
                            $data['materials'] = $materialModel->select('materials.*, courses.course_name, courses.course_code')
                                ->join('courses', 'courses.id = materials.course_id')
                                ->whereIn('materials.course_id', $courseIds)
                                ->orderBy('materials.created_at', 'DESC')
                                ->findAll();
---
SELECT `materials`.*, `courses`.`course_name`, `courses`.`course_code`
FROM `materials`
JOIN `courses` ON `courses`.`id` = `materials`.`course_id`
WHERE `materials`.`course_id` IN ('7','8')
ORDER BY `materials`.`created_at` DESC