app/Models/EnrollmentModel.php

    public function getUserEnrollments($user_id)
    {
        // Check if teacher_id column exists before trying to join
        if ($this->db->fieldExists('teacher_id', 'courses')) {
            $select = 'enrollments.*, courses.id as course_id, courses.course_name, courses.course_code, courses.description, courses.teacher_id, users.name as teacher_name';

            $query = $this->select($select)
                          ->join('courses', 'courses.id = enrollments.course_id')
                          ->join('users', 'users.id = courses.teacher_id', 'left');

            return $query->where('enrollments.user_id', $user_id)
                         ->findAll();
---
SELECT `enrollments`.*, `courses`.`id` as `course_id`, `courses`.`course_name`, `courses`.`course_code`, `courses`.`description`, `courses`.`teacher_id`, `users`.`name` as `teacher_name`
FROM `enrollments`
JOIN `courses` ON `courses`.`id` = `enrollments`.`course_id`
LEFT JOIN `users` ON `users`.`id` = `courses`.`teacher_id`
WHERE `enrollments`.`user_id` = '3'